/**
 * Created by out_xu on 16/12/20.
 */
import {message} from "antd";
//TODO 添加状态码 http://marklux.cn/blog/29
const codeMap = {
    "500": "内部错误",
    "1001": "e-mail已被注册",
    "1002": "手机号已被注册",
    "1003": "用户名已被注册",
    "1004": "请登录",
    "1005": "表单验证出错",
    "1006": "密码错误",
    "1007": "您的权限不够",
    "1008": "注册失败",
    "1011": "用户已经存在",
    "1012": "用户不存在",

    "2001": "同名用户组已经存在",
    "2002": "用户组不存在",
    "2003": "用户已在组内",
    "2004": "用户组已经关闭",
    "2005": "用户组已满",
    "2006": "用户不在组内",
    "2007": "该通知不属于本用户组",
    "2008": "通知不存在",

    "6001": "题目不存在",
    "6002": "编译信息不存在",
    "6003": "运行信息不存在",
    "6004": "解题状态不存在",

    "7001": "删除记录不存在"

};

export default (code)=> {
    if (codeMap[code]) {
        message.error(codeMap[code]);
    } else {
        message.error("未知错误");
    }
}